app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT "categories".* FROM "categories" LIMIT 1

  def show
    @categories = Category.all
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('toy', '2011-06-11 07:09:42.863642', '2011-06-11 07:09:42.863642')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
UPDATE "categories" SET "name" = 'toy', "updated_at" = '2011-06-11 09:35:32.074638' WHERE "categories"."id" = 1