app/controllers/products_controller.rb

  def index
  	@categories = Category.all
    @category = Category.first

    @products = Product.all
---
SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products"

  def show

  	@categories = Category.all
    @category = Category.first

    @product = Product.find(params[:id])
---
SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products" WHERE "products"."id" = 0 LIMIT 1

  def create
    @category = Category.find(params[:category_id])
    @product = @category.products.create(params[:product])

    respond_to do |format|
      if @product.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 0 LIMIT 1
INSERT INTO "products" ("name", "img_path", "content", "category_id", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size") VALUES ('111', '/images/products/bag/cigarette pouch.JPG', '111', 1, '2011-06-12 07:33:33.367922', '2011-06-12 07:33:33.367922', NULL, NULL, NULL)
UPDATE "products" SET "img_path" = '/Users/Littlepan/workspace/chinapride/public/system/photos/4/original/GG25.jpg', "updated_at" = '2011-06-11 07:57:50.927700' WHERE "products"."id" = 4

  def update
    # @category = Category.find(params[:category_id])
    # @product = @category.products.find(params[:product])
    @product = Product.find(params[:id])
    @product.category = Category.find(params[:category_id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
UPDATE "products" SET "photo_file_name" = 'GG29.jpg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 148447, "updated_at" = '2011-06-11 06:23:57.423895' WHERE "products"."id" = 1