app/views/categories/show.html.erb

  <ul class="browse-auctions">
  <% @category.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE ("products".category_id = 1)