app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <div class="field">
	<%= select_tag :category_id, options_for_select(Category.all.collect{|x| [x.name, x.id]}, @category_id)%>